const endings={
    A:{
        title:"Ending A",
        text:`당신은 삶에서 원하는 대부분의 선택을 할 수 있었습니다.

        좋은 교육을 받을 수 있었고,
        원하는 대학과 대학원에 진학할 수 있었으며,
        교환학생과 다양한 경험도 쌓았습니다.

        많은 기회가 당신 앞에 열려 있었고,
        그 기회를 붙잡을 수 있었습니다.

        노력은 분명 중요했습니다.
        하지만 그 노력이 더욱 빛날 수 있었던 이유는
        도전할 수 있는 환경이 함께 있었기 때문입니다.`
    },

    B:{
        title:"Ending B",
        text:`당신은 삶에서 대부분의 기회를 붙잡을 수 있었습니다.

        하지만 그 기회를 붙잡는 과정에는
        많은 고민이 필요했습니다.

        어떤 선택은 포기해야 했고,
        어떤 선택을 위해서는
        다른 곳에서 노력해야 했으며,
        그 과정에서 삶의 경로가
        의도치 않게 변화하기도 했습니다.

        당신은 분명 노력했습니다.

        그러나 누군가는 당신보다
        더 쉽게 그 선택을 할 수 있었고,
        반대로 또 다른 누군가는
        그 선택을 위해 당신보다
        더 오랜 시간을 고민해야만 했습니다.`
    },

    C:{
        title:"Ending C",
        text:`당신은 많은 선택 앞에서
        경제적인 현실을 먼저 생각해야 했습니다.

        원하는 길을 포기하기도 했고,
        같은 목표를 위해
        더 많은 시간을 일해야 했습니다.

        기회를 얻더라도
        그 기회를 유지하기 위해
        끊임없이 노력해야 했습니다.

        당신은 분명 최선을 다했습니다.

        하지만 노력만으로는
        넘어설 수 없는 현실도 존재했습니다.`
    }
};

const endingMessage=`모두에게 같은 선택의 기회가
주어지는 것은 아닙니다.

우리 삶의 성과는 온전히,
노력만으로 이루어지는 것일까요?`;