const endings={
    A:{
        title:"Ending A",
        text:`당신은 삶에서 원하는 대부분의 선택을 할 수 있었습니다.

        좋은 교육을 받을 수 있었고,
        원하는 대학과 대학원에 진학할 수 있었으며,
        교환학생과 다양한 경험도 쌓았습니다.

        많은 기회가 당신 앞에 열려 있었고,
        그 기회를 붙잡을 수 있었습니다.

        노력은 분명 중요했습니다.
        하지만 그 노력이 더욱 빛날 수 있었던 이유는
        도전할 수 있는 환경이 함께 있었기 때문입니다.`
    },

    B:{
        title:"Ending B",
        text:`당신은 삶에서 대부분의 기회를 붙잡을 수 있었습니다.

        하지만 그 기회를 붙잡는 과정에는
        많은 고민이 필요했습니다.

        어떤 선택은 포기해야 했고,
        어떤 선택을 위해서는
        다른 곳에서 노력해야 했으며,
        그 과정에서 삶의 경로가
        의도치 않게 변화하기도 했습니다.

        당신은 분명 노력했습니다.

        그러나 누군가는 당신보다
        더 쉽게 그 선택을 할 수 있었고,
        반대로 또 다른 누군가는
        그 선택을 위해 당신보다
        더 오랜 시간을 고민해야만 했습니다.`
    },

    C:{
        title:"Ending C",
        text:`당신은 주어진 환경 속에서 최선을 다했습니다.
        필요한 자격증을 준비했고, 생활비를 마련하며 학교를 다녔고, 할 수 있는 방법으로 취업을 준비했습니다. 
        원하는 대학을 포기하기도 했고, 교환학생과 무급 인턴을 망설인 끝에 다른 길을 선택하기도 했습니다.
        
        당신이 덜 노력했던 것은 아닙니다. 다만, 같은 목표를 향해 다른 조건에서 노력했을 뿐입니다.
        우리는 종종 결과만으로 사람의 능력과 노력을 평가합니다. 
        하지만 모든 사람은 같은 출발선에서 시작하지 않습니다. 
`
    }
};

const endingMessage=`모두에게 같은 선택의 기회가
주어지는 것은 아닙니다.

우리 삶의 성과는 온전히,
노력만으로 이루어지는 것일까요?`;
